#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.provisioner_key: Refreshing state... [id=1afa2b217f86273c8541cc4c259b82625b093cb0]
google_compute_network.vpc-network: Refreshing state... [id=projects/kingboo/global/networks/vm-kingboo-network]
google_compute_firewall.ssh-rule: Refreshing state... [id=projects/kingboo/global/firewalls/allow-ssh]
google_compute_instance.vm-instance: Refreshing state... [id=projects/kingboo/zones/us-east1-b/instances/vm-instance]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.vm-instance must be replaced
-/+ resource "google_compute_instance" "vm-instance" {
      ~ cpu_platform              = "Intel Haswell" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "projects/kingboo/zones/us-east1-b/instances/vm-instance" -> (known after apply)
      ~ instance_id               = "3187812201609979590" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      - labels                    = {} -> null
      ~ metadata_fingerprint      = "HbwxlSm2dM0=" -> (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "vm-instance"
      ~ project                   = "kingboo" -> (known after apply)
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/kingboo/zones/us-east1-b/instances/vm-instance" -> (known after apply)
        tags                      = [
            "externalssh",
        ]
      ~ tags_fingerprint          = "3xojOZ8evN8=" -> (known after apply)
      ~ zone                      = "us-east1-b" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kingboo/zones/us-east1-b/disks/vm-instance" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/centos-cloud/global/images/centos-8-v20210817" -> "centos-7" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 20 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network_ip         = "10.142.0.2" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/kingboo/regions/us-east1/subnetworks/vm-kingboo-network" -> (known after apply)
          ~ subnetwork_project = "kingboo" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ access_config {
              ~ nat_ip       = "35.211.39.180" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }


      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vm_external_ip = "35.211.39.180" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: westus02.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "westus02.tfplan"

```

</details>

*Pusher: @piotrwestphal, Action: `pull_request`, Working Directory: `./cloud/gcp/westus02/terraform`, Workflow: `Plan infrastructure on westus02`*